# RbsEnergyAnalysisViewTransparentMode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisViewTransparentMode Property
ParameterTypeId Class See Also
---
"Show Surfaces Transparent"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisViewTransparentMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisViewTransparentMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewTransparentMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace